---
kind: property
id: P:Autodesk.Revit.DB.ReferencePlane.Name
source: html/9026faa7-b77c-c9e3-b33c-818492decaa7.htm
---
# Autodesk.Revit.DB.ReferencePlane.Name Property

The name property of the reference plane.

## Syntax (C#)
```csharp
public string Name { get; set; }
```

## Remarks
This property overrides Element's default implementation.